In [2]:
%load_ext sql

In [3]:
%sql postgresql://transom:student@127.0.0.1/sparkifydb

In [16]:
%sql SELECT * FROM songplays order by song_id desc LIMIT 5;

 * postgresql://transom:***@127.0.0.1/sparkifydb
5 rows affected.

[(5537, datetime.datetime(2018, 11, 21, 21, 56, 47, 796000), 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36'),
 (3, datetime.datetime(2018, 11, 11, 2, 40, 34, 796000), 69, 'free', '', '', 455, 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36'),
 (4, datetime.datetime(2018, 11, 11, 4, 36, 13, 796000), 32, 'free', '', '', 456, 'New York-Newark-Jersey City, NY-NJ-PA', 'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36'),
 (5, datetime.datetime(2018, 11, 11, 4, 36, 46, 796000), 75, 'free', '', '', 284, 'Columbia, SC', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_3) AppleWebKit/537.75.14 (KHTML, like Gecko) Version/7.0.3 Safari/537.75.14'),
 (2, datetime.datetime(2018, 11, 11, 2, 36, 10, 796000), 69, 'free', '', '', 455, 'Philadelphia-Camden-Wilmington, PA-NJ-DE-MD', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36')]

In [6]:
%sql SELECT * FROM users LIMIT 15;

 * postgresql://transom:***@127.0.0.1/sparkifydb
15 rows affected.

[(69, 'Anabelle', 'Simpson', 'F', 'free'),
 (69, 'Anabelle', 'Simpson', 'F', 'free'),
 (69, 'Anabelle', 'Simpson', 'F', 'free'),
 (32, 'Lily', 'Burns', 'F', 'free'),
 (75, 'Joseph', 'Gutierrez', 'M', 'free'),
 (92, 'Ryann', 'Smith', 'F', 'free'),
 (92, 'Ryann', 'Smith', 'F', 'free'),
 (92, 'Ryann', 'Smith', 'F', 'free'),
 (92, 'Ryann', 'Smith', 'F', 'free'),
 (92, 'Ryann', 'Smith', 'F', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'free'),
 (49, 'Chloe', 'Cuevas', 'F', 'free')]

In [24]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://transom:***@127.0.0.1/sparkifydb
5 rows affected.

[('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, Decimal('233.40363')),
 ('SOIAZJW12AB01853F1', 'Pink World', 'AR8ZCNI1187B9A069B', 1984, Decimal('269.81832')),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, Decimal('209.60608')),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', 0, Decimal('189.57016')),
 ('SOQHXMF12AB0182363', 'Young Boy Blues', 'ARGSJW91187B9B1D6B', 0, Decimal('218.77506'))]

In [25]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://transom:***@127.0.0.1/sparkifydb
5 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', None, None),
 ('AR8ZCNI1187B9A069B', 'Planet P Project', '', None, None),
 ('ARXR32B1187FB57099', 'Gob', '', None, None),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', None, None),
 ('ARGSJW91187B9B1D6B', 'JennyAnyKind', 'North Carolina', '35.21962', '-80.01955')]

In [17]:
%sql SELECT * FROM time limit 10;

 * postgresql://transom:***@127.0.0.1/sparkifydb
10 rows affected.

[(datetime.datetime(2018, 11, 11, 2, 33, 56, 796000), 2, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 2, 36, 10, 796000), 2, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 2, 40, 34, 796000), 2, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 4, 36, 13, 796000), 4, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 4, 36, 46, 796000), 4, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 9, 56, 28, 796000), 9, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 0, 47, 796000), 10, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 4, 7, 796000), 10, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 8, 28, 796000), 10, 11, 45, 11, 2018, 6),
 (datetime.datetime(2018, 11, 11, 10, 12, 0, 796000), 10, 11, 45, 11, 2018, 6)]

In [23]:
%sql SELECT count(level) FROM users WHERE level = 'paid';

 * postgresql://transom:***@127.0.0.1/sparkifydb
1 rows affected.

[(5591,)]

In [ ]:
## Find the location with the most listeners

In [33]:
%sql SELECT location, count(location) as num_of_listeners FROM songplays group by location order by num_of_listeners desc limit 5;

 * postgresql://transom:***@127.0.0.1/sparkifydb
5 rows affected.

[('San Francisco-Oakland-Hayward, CA', 691),
 ('Portland-South Portland, ME', 665),
 ('Lansing-East Lansing, MI', 557),
 ('Chicago-Naperville-Elgin, IL-IN-WI', 475),
 ('Atlanta-Sandy Springs-Roswell, GA', 456)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).